We just had this similar thing happen for a disk import as well:
```HCL
  # module.core.module.server_sql.azurerm_managed_disk.main[4] must be replaced
-/+ resource "azurerm_managed_disk" "main" {
        create_option        = "Empty"
      ~ disk_iops_read_write = 500 -> (known after apply)
      ~ disk_mbps_read_write = 100 -> (known after apply)
        disk_size_gb         = 100
      ~ id                   = "/subscriptions/xxxx-xxxx-xxxx-xxxx/resourceGroups/DEF456-RG/providers/Microsoft.Compute/disks/vm0db9-datadisk-4" -> (known after apply)
        location             = "centralus"
        name                 = "def456-vm0db9-datadisk-4"
      ~ resource_group_name  = "DEF456-RG" -> "def456-rg" # forces replacement
      + source_uri           = (known after apply)
        storage_account_type = "Premium_LRS"
      - zones                = [] -> null

      - timeouts {}
    }
```

This disk was added through the portal by mistake, and we imported it.
After the import and attempting run an apply, it wants to replace it for a similar reason as the backup item.
It seems like items potentially updated/created through the portal are sometimes pinning the uppercase resource group name to the metadata/path and terraform imports it and expects it to be lowercase, however, it may not be.

